mkj/imxrt-pacs/svd/MIMXRT1021.svd
        <register>
          <name>REG_2P5_CLR</name>
          <description>Regulator 2P5 Register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1073</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE_LINREG</name>
              <description>Control bit to enable the regulator output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_BO</name>
              <description>Control bit to enable the brownout circuitry in the regulator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_ILIMIT</name>
              <description>Control bit to enable the current-limit circuitry in the regulator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_PULLDOWN</name>
              <description>Control bit to enable the pull-down circuitry in the regulator</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BO_OFFSET</name>
              <description>Control bits to adjust the regulator brownout offset voltage in 25mV steps</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_TRG</name>
              <description>Control bits to adjust the regulator output voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTPUT_TRG_0</name>
                  <description>2.10V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_TRG_16</name>
                  <description>2.50V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_TRG_31</name>
                  <description>2.875V</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BO_VDD2P5</name>
              <description>Status bit that signals when a brownout is detected on the regulator output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OK_VDD2P5</name>
              <description>Status bit that signals when the regulator output is ok. 1 = regulator output &gt; brownout target</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_WEAK_LINREG</name>
              <description>Enables the weak 2p5 regulator</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_2P5_TOG</name>
          <description>Regulator 2P5 Register</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1073</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE_LINREG</name>
              <description>Control bit to enable the regulator output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_BO</name>
              <description>Control bit to enable the brownout circuitry in the regulator.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_ILIMIT</name>
              <description>Control bit to enable the current-limit circuitry in the regulator.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_PULLDOWN</name>
              <description>Control bit to enable the pull-down circuitry in the regulator</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BO_OFFSET</name>
              <description>Control bits to adjust the regulator brownout offset voltage in 25mV steps</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_TRG</name>
              <description>Control bits to adjust the regulator output voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTPUT_TRG_0</name>
                  <description>2.10V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_TRG_16</name>
                  <description>2.50V</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_TRG_31</name>
                  <description>2.875V</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BO_VDD2P5</name>
              <description>Status bit that signals when a brownout is detected on the regulator output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OK_VDD2P5</name>
              <description>Status bit that signals when the regulator output is ok. 1 = regulator output &gt; brownout target</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_WEAK_LINREG</name>
              <description>Enables the weak 2p5 regulator</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
