mkj/imxrt-pacs/svd/MIMXRT1021.svd
        <register>
          <name>PROT_CTRL</name>
          <description>Protocol Control</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8800020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTW</name>
              <description>Data transfer width</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTW_0</name>
                  <description>1-bit mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTW_1</name>
                  <description>4-bit mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTW_2</name>
                  <description>8-bit mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D3CD</name>
              <description>DATA3 as card detection pin</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D3CD_0</name>
                  <description>DATA3 does not monitor card insertion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D3CD_1</name>
                  <description>DATA3 as card detection pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMODE</name>
              <description>Endian mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMODE_0</name>
                  <description>Big endian mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMODE_1</name>
                  <description>Half word big endian mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMODE_2</name>
                  <description>Little endian mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASEL</name>
              <description>DMA select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASEL_0</name>
                  <description>No DMA or simple DMA is selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASEL_1</name>
                  <description>ADMA1 is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASEL_2</name>
                  <description>ADMA2 is selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SABGREQ</name>
              <description>Stop at block gap request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SABGREQ_0</name>
                  <description>Transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SABGREQ_1</name>
                  <description>Stop</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CREQ</name>
              <description>Continue request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CREQ_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CREQ_1</name>
                  <description>Restart</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWCTL</name>
              <description>Read wait control</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWCTL_0</name>
                  <description>Disables read wait control and stop SD clock at block gap when SABGREQ field is set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWCTL_1</name>
                  <description>Enables read wait control and assert read wait without stopping SD clock at block gap when SABGREQ field is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IABG</name>
              <description>Interrupt at block gap</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IABG_0</name>
                  <description>Disables interrupt at block gap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IABG_1</name>
                  <description>Enables interrupt at block gap</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_DONE_NO_8CLK</name>
              <description>Read performed number 8 clock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WECINT</name>
              <description>Wakeup event enable on card interrupt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WECINT_0</name>
                  <description>Disables wakeup event enable on card interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WECINT_1</name>
                  <description>Enables wakeup event enable on card interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WECINS</name>
              <description>Wakeup event enable on SD card insertion</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WECINS_0</name>
                  <description>Disable wakeup event enable on SD card insertion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WECINS_1</name>
                  <description>Enable wakeup event enable on SD card insertion</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WECRM</name>
              <description>Wakeup event enable on SD card removal</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WECRM_0</name>
                  <description>Disables wakeup event enable on SD card removal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WECRM_1</name>
                  <description>Enables wakeup event enable on SD card removal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURST_LEN_EN</name>
              <description>BURST length enable for INCR, INCR4 / INCR8 / INCR16, INCR4-WRAP / INCR8-WRAP / INCR16-WRAP</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BURST_LEN_EN_1</name>
                  <description>Burst length is enabled for INCR.</description>
                  <value>#xx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NON_EXACT_BLK_RD</name>
              <description>Non-exact block read</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_EXACT_BLK_RD_0</name>
                  <description>The block read is exact block read. Host driver does not need to issue abort command to terminate this multi-block read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_EXACT_BLK_RD_1</name>
                  <description>The block read is non-exact block read. Host driver needs to issue abort command to terminate this multi-block read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_CTRL</name>
          <description>System Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80800F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DVS</name>
              <description>Divisor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DVS_0</name>
                  <description>Divide-by-1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVS_1</name>
                  <description>Divide-by-2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVS_14</name>
                  <description>Divide-by-15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVS_15</name>
                  <description>Divide-by-16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDCLKFS</name>
              <description>SDCLK frequency select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTOCV</name>
              <description>Data timeout counter value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTOCV_0</name>
                  <description>SDCLK x 2 14</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_1</name>
                  <description>SDCLK x 2 15</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_2</name>
                  <description>SDCLK x 2 16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_3</name>
                  <description>SDCLK x 2 17</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_4</name>
                  <description>SDCLK x 2 18</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_5</name>
                  <description>SDCLK x 2 19</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_6</name>
                  <description>SDCLK x 2 20</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_7</name>
                  <description>SDCLK x 2 21</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_8</name>
                  <description>SDCLK x 2 22</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_9</name>
                  <description>SDCLK x 2 23</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_10</name>
                  <description>SDCLK x 2 24</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_11</name>
                  <description>SDCLK x 2 25</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_12</name>
                  <description>SDCLK x 2 26</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_13</name>
                  <description>SDCLK x 2 27</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_14</name>
                  <description>SDCLK x 2 28</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_15</name>
                  <description>SDCLK x 2 29</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPP_RST_N</name>
              <description>Hardware reset</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTA</name>
              <description>Software reset for all</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSTA_0</name>
                  <description>No reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTA_1</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTC</name>
              <description>Software reset for CMD line</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSTC_0</name>
                  <description>No reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTC_1</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTD</name>
              <description>Software reset for data line</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSTD_0</name>
                  <description>No reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTD_1</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INITA</name>
              <description>Initialization active</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTT</name>
              <description>Reset tuning</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
