mkj/imxrt-pacs/svd/MIMXRT1021.svd
        <register>
          <name>TRIG6_CHAIN_5_4</name>
          <description>ETC_TRIG Chain 4/5 Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSEL4</name>
              <description>ADC channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSEL4_0</name>
                  <description>ADC Channel 0 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_1</name>
                  <description>ADC Channel 1 selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_2</name>
                  <description>ADC Channel 2 selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_3</name>
                  <description>ADC Channel 3 selected.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_4</name>
                  <description>ADC Channel 4 selected.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_5</name>
                  <description>ADC Channel 5 selected.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_6</name>
                  <description>ADC Channel 6 selected.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_7</name>
                  <description>ADC Channel 7 selected.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_8</name>
                  <description>ADC Channel 8 selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_9</name>
                  <description>ADC Channel 9 selected.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_10</name>
                  <description>ADC Channel 10 selected.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_11</name>
                  <description>ADC Channel 11 selected.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_12</name>
                  <description>ADC Channel 12 selected.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_13</name>
                  <description>ADC Channel 13 selected.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_14</name>
                  <description>ADC Channel 14 selected.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL4_15</name>
                  <description>ADC Channel 15 selected.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWTS4</name>
              <description>Segment 4 HWTS ADC hardware trigger selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWTS4_0</name>
                  <description>no trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS4_1</name>
                  <description>ADC TRIG0 selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS4_2</name>
                  <description>ADC TRIG1 selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS4_4</name>
                  <description>ADC TRIG2 selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS4_8</name>
                  <description>ADC TRIG3 selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS4_16</name>
                  <description>ADC TRIG4 selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS4_32</name>
                  <description>ADC TRIG5 selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS4_64</name>
                  <description>ADC TRIG6 selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS4_128</name>
                  <description>ADC TRIG7 selected</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B2B4</name>
              <description>Segment 4 B2B</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B2B4_0</name>
                  <description>Disable B2B. Wait until delay value defined by TRIG4_COUNTER[SAMPLE_INTERVAL] is reached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2B4_1</name>
                  <description>Enable B2B. When Segment 0 finished (ADC COCO) then automatically trigger next ADC conversion, no need to wait until interval delay reached.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE4</name>
              <description>Segment 4 done interrupt selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IE4_0</name>
                  <description>No interrupt when finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE4_1</name>
                  <description>Generate interrupt on Done0 when segment 4 finish.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE4_2</name>
                  <description>Generate interrupt on Done1 when segment 4 finish.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE4_3</name>
                  <description>Generate interrupt on Done2 when segment 4 finish.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSEL5</name>
              <description>ADC channel selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSEL5_0</name>
                  <description>ADC Channel 0 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_1</name>
                  <description>ADC Channel 1 selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_2</name>
                  <description>ADC Channel 2 selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_3</name>
                  <description>ADC Channel 3 selected.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_4</name>
                  <description>ADC Channel 4 selected.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_5</name>
                  <description>ADC Channel 5 selected.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_6</name>
                  <description>ADC Channel 6 selected.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_7</name>
                  <description>ADC Channel 7 selected.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_8</name>
                  <description>ADC Channel 8 selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_9</name>
                  <description>ADC Channel 9 selected.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_10</name>
                  <description>ADC Channel 10 selected.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_11</name>
                  <description>ADC Channel 11 selected.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_12</name>
                  <description>ADC Channel 12 selected.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_13</name>
                  <description>ADC Channel 13 selected.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_14</name>
                  <description>ADC Channel 14 selected.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL5_15</name>
                  <description>ADC Channel 15 selected.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWTS5</name>
              <description>Segment 5 HWTS ADC hardware trigger selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWTS5_0</name>
                  <description>no trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS5_1</name>
                  <description>ADC TRIG0 selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS5_2</name>
                  <description>ADC TRIG1 selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS5_4</name>
                  <description>ADC TRIG2 selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS5_8</name>
                  <description>ADC TRIG3 selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS5_16</name>
                  <description>ADC TRIG4 selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS5_32</name>
                  <description>ADC TRIG5 selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS5_64</name>
                  <description>ADC TRIG6 selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS5_128</name>
                  <description>ADC TRIG7 selected</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B2B5</name>
              <description>Segment 5 B2B</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B2B5_0</name>
                  <description>Disable B2B. Wait until delay value defined by TRIG5_COUNTER[SAMPLE_INTERVAL] is reached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2B5_1</name>
                  <description>Enable B2B. When Segment 0 finished (ADC COCO) then automatically trigger next ADC conversion, no need to wait until interval delay reached.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE5</name>
              <description>Segment 5 done interrupt selection</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IE5_0</name>
                  <description>No interrupt when finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE5_1</name>
                  <description>Generate interrupt on Done0 when segment 5 finish.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE5_2</name>
                  <description>Generate interrupt on Done1 when segment 5 finish.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE5_3</name>
                  <description>Generate interrupt on Done2 when segment 5 finish.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
